src/functionalTest/resources/xml/request/xml_request_issue_399_payload.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://example.com/schema1">
<soap:Body>
    <ns1:RequestElement>
        <ns1:FieldOne>banana</ns1:FieldOne>
        <ns1:FieldTwo>apple</ns1:FieldTwo>
        <ns1:FieldThree>strawberry</ns1:FieldThree>
        <ns1:FieldFour>melon</ns1:FieldFour>
    </ns1:RequestElement>
</soap:Body>
</soap:Envelope>
